Repository: LanaD-coder/a-light-unto-my-path
Catalog: locale/*/LC_MESSAGES/django.po
Languages: de

source: Let's get to know each other
de: Lass uns einander kennenlernen

source: A light unto my path!
de: Ein Licht auf meinem Weg!

source: Welcome to the site! Before I dive into the deep stuff (and I promise, I will, but bear with me), let’s talk about the Team—because honestly, they're the real MVPs here. I'm just one of the four members. I am a mature woman (yes, \
de: Willkommen auf der Seite! Bevor ich in die tiefgründigen Dinge eintauche (und ich verspreche, das werde ich tun – bleib bitte dran), möchte ich über das Team sprechen – denn ehrlich gesagt, sie sind die wahren Helden hier. Ich bin nur eines von vier Mitgliedern. Ich bin eine reife Frau (ja, \

source: Now, before you click away thinking, “Uh-oh, this is definitely not my vibe,” I get it. You might fall into one of these categories:
de: Bevor du jetzt wegklickst und denkst: „Oh-oh, das ist definitiv nicht mein Ding“ – ich verstehe dich. Vielleicht gehörst du zu einer dieser Kategorien:

source: You don’t believe in God, Jesus, or the Holy Spirit (Hopefully you will stick around and change that, because God believes in you).
de: Du glaubst nicht an Gott, Jesus oder den Heiligen Geist (hoffentlich bleibst du trotzdem und änderst das – denn Gott glaubt an dich).

source: You believe, but you might be wondering, “Can a lesbian really be a Christian?” (Spoiler alert: Absolutely!)
de: Du glaubst, aber fragst dich vielleicht: „Kann eine Lesbe wirklich Christin sein?“ (Spoiler: Absolut!)

source: You’re just not here for this entire conversation (I’ll send you virtual hugs, and I totally understand if this is not your jam).
de: Du bist einfach nicht wegen dieses ganzen Themas hier (ich schicke dir virtuelle Umarmungen und verstehe vollkommen, wenn das nicht dein Ding ist).

source: But if you’re still with me, I’m glad you’re here. And I promise I’ll take you on a journey you didn’t expect. You see, I grew up in a quiet little town in the heart of nowhere Africa. It was peaceful, we had all the basics—food, a roof over our heads, and a sense of comfort. But... Sundays were a bit of a drag. Like most kids in my country, I was dragged to church, even though I couldn’t figure out why I had to go. It was just what you did. But here’s the thing – I also knew early on that I was gay. And in that little town, where conservative values were in full swing, being gay wasn’t exactly “the vibe.” Add Sundays into the mix, and I found myself super confused. What’s worse? My church wasn’t exactly rolling out the rainbow carpet. I began wondering, “Does God really love me? Is it even okay to be gay AND believe in God?” Spoiler #2: I had no clue, and neither did most people I met. Fast forward to now, and I’m on a mission to give a different answer: YES, God loves us all! Whether you're gay, straight, bi, or somewhere in between, you are loved. If you’ve ever been told that God doesn’t love you because of your sexuality, then this website was made for you. I want to show you a different side of faith—one that embraces ALL people, just as they are. So, here’s what this website is all about:
de: Aber wenn du noch hier bist, freut es mich sehr, dass du da bist. Und ich verspreche dir, ich nehme dich mit auf eine Reise, die du nicht erwartet hast. Ich bin in einem ruhigen kleinen Ort im Nirgendwo Afrikas aufgewachsen. Es war friedlich, wir hatten das Nötigste – Essen, ein Dach über dem Kopf und ein Gefühl von Geborgenheit. Aber ... Sonntage waren eher anstrengend. Wie die meisten Kinder in meinem Land wurde ich zur Kirche mitgeschleppt, obwohl ich nicht wirklich verstand, warum. Es gehörte einfach dazu. Aber hier ist der Punkt – ich wusste schon früh, dass ich homosexuell bin. In dieser kleinen Stadt, in der konservative Werte vorherrschten, war das nicht gerade angesagt. Mit den Sonntagen kam auch die Verwirrung. Und schlimmer noch: Meine Kirche hieß Menschen wie mich nicht gerade willkommen. Ich fragte mich: „Liebt Gott mich wirklich? Darf ich überhaupt schwul sein UND an Gott glauben?“ Spoiler #2: Ich hatte keine Ahnung. Und die meisten Menschen, die ich traf, auch nicht. Heute bin ich auf einer Mission, eine andere Antwort zu geben: JA, Gott liebt uns alle! Egal ob du homosexuell, hetero, bi oder irgendwo dazwischen bist – du wirst geliebt. Wenn dir jemals jemand gesagt hat, dass Gott dich wegen deiner Sexualität nicht liebt, dann wurde diese Website genau für dich gemacht. Ich möchte dir eine andere Seite des Glaubens zeigen – eine, die ALLE Menschen annimmt, so wie sie sind. Und genau darum geht es auf dieser Website:

source: The Mission:
de: Die Mission:

source: The mission is simple (but profound): Share my thoughts, growth, and insights as a gay Christian and show that faith and sexuality don’t have to be at odds. By doing so, I hope to help others feel that they, too, can be loved by God – exactly as they are.
de: Die Mission ist einfach (aber tiefgründig): Ich teile meine Gedanken, meinen Weg und meine Erkenntnisse als lesbische Christin und zeige, dass Glaube und Sexualität sich nicht widersprechen müssen. Damit möchte ich anderen helfen zu erkennen, dass auch sie von Gott geliebt sind – genau so, wie sie sind.

source: The Five Values of this Website:
de: Die fünf Werte dieser Website:

source: Love First, Judge Never
de: Liebe zuerst, niemals urteilen

source: This site is about one thing—love. No judgments, no \
de: Auf dieser Seite geht es nur um eines – Liebe. Keine Urteile, kein \

source: Acceptance Over Rejection
de: Annahme statt Ablehnung

source: I want to help people who feel rejected by their faith to see that God doesn’t turn away from them. Ever. We’re all welcome here, just as we are.
de: Ich möchte Menschen, die sich durch ihren Glauben abgelehnt fühlen, helfen zu erkennen, dass Gott sich nie von ihnen abwendet. Wir sind hier alle willkommen – genau so, wie wir sind.

source: Honesty, Even When It’s Tough
de: Ehrlichkeit, auch wenn es schwer ist

source: I’m not going to sugar-coat it. Life is hard, faith can be confusing, and sometimes, it feels like the world doesn’t get us. But honesty—raw, real honesty—will always be our guiding star.
de: Ich werde nichts beschönigen. Das Leben ist hart, Glaube kann verwirrend sein, und manchmal hat man das Gefühl, nicht verstanden zu werden. Aber Ehrlichkeit – echte, rohe Ehrlichkeit – wird immer unser Leitstern sein.

source: Growth Through Faith
de: Wachstum durch Glauben

source: This site is a place to explore, question, and grow. Whether you’re just starting to find your way back to God or you’ve always been on this journey, we’re in this together. Growth is a messy, beautiful process!
de: Diese Seite ist ein Ort zum Erkunden, Fragen stellen und Wachsen. Egal ob du gerade erst beginnst, deinen Weg zu Gott zu finden, oder schon lange auf dieser Reise bist – wir sind gemeinsam unterwegs. Wachstum ist ein chaotischer, aber wunderschöner Prozess!

source: Hope That’s Bigger Than Fear
de: Hoffnung, die größer ist als Angst

source: Fear tries to hold us back. Fear of rejection, fear of not being enough, fear of stepping into the unknown. But the hope we find in faith is so much bigger than any fear. And here, that hope is always in abundance.
de: Angst versucht, uns zurückzuhalten. Angst vor Ablehnung, Angst, nicht genug zu sein, Angst vor dem Unbekannten. Aber die Hoffnung, die wir im Glauben finden, ist so viel größer als jede Angst. Und hier gibt es diese Hoffnung im Überfluss.

source: So, whether you’re here because you’re curious, you’re looking for some comfort, or you just want to explore a different way of viewing faith and sexuality, I’m thrilled you found your way to this website. God loves us ALL—rainbow flags and all—and that’s the truth I’m here to share. Take a seat, stay for a while, and let’s have some real, honest conversations about God, Jesus, the Holy Spirit... and everything in between.
de: Egal ob du hier bist, weil du neugierig bist, Trost suchst oder einfach eine andere Sicht auf Glauben und Sexualität erkunden möchtest – ich freue mich riesig, dass du den Weg zu dieser Website gefunden hast. Gott liebt uns ALLE – mit Regenbogenflagge und allem – und genau diese Wahrheit möchte ich teilen. Nimm Platz, bleib eine Weile und lass uns echte, ehrliche Gespräche führen – über Gott, Jesus, den Heiligen Geist ... und alles dazwischen.

source: Sign In / Sign Up
de: Anmelden / Registrieren

source: Sign In
de: Anmelden

source: Sign Up
de: Registrieren

source: Already have an account?
de: Haben Sie bereits ein Konto?

source: Sign in
de: Anmelden

source: You have successfully signed out.
de: Sie haben sich erfolgreich abgemeldet.

source: Thank you for visiting. We hope to see you again soon!
de: Vielen Dank für Ihren Besuch. Wir hoffen, Sie bald wiederzusehen!

source: Return to Homepage
de: Zurück zur Startseite

source: We would love to hear from you.
de: Wir würden gerne von Ihnen hören.

source: If you are part of our community and this blog stirs something in your spirit—whether it brings feelings of anger, sadness, confusion, or hope—please don’t hesitate to reach out. With the Lord’s guidance, I will do my best to support and walk alongside you.
de: Wenn Sie Teil unserer Gemeinschaft sind und dieser Blog etwas in Ihrem Geist bewegt – sei es Wut, Traurigkeit, Verwirrung oder Hoffnung – zögern Sie bitte nicht, uns zu kontaktieren. Mit der Führung des Herrn werde ich mein Bestes tun, Sie zu unterstützen und an Ihrer Seite zu gehen.

source: Contact Me
de: Kontaktieren Sie mich

source: Subject
de: Betreff

source: Message
de: Nachricht

source: Send Message
de: Nachricht senden

source: Do you need to speak to someone?
de: Müssen Sie mit jemandem sprechen?

source: If you need urgent support or guidance, as a member of the LGBTA++ community or a parent, please reach out. We are here to help.
de: Wenn Sie als Mitglied der LGBTA++-Gemeinschaft oder als Elternteil dringend Unterstützung oder Orientierung benötigen, kontaktieren Sie uns bitte. Wir sind hier, um zu helfen.

source: Contact Helpline
de: Kontakt zur Hotline

source: Success!
de: Erfolg!

source: Close
de: Schließen

source: Your message has been sent successfully. We will get back to you soon! God bless!
de: Ihre Nachricht wurde erfolgreich gesendet. Wir werden uns bald bei Ihnen melden! Gottes Segen!

source: Helpline Information
de: Informationen zur Hotline

source: If you need immediate assistance, please reach out:
de: Wenn Sie sofortige Hilfe benötigen, kontaktieren Sie uns bitte:

source: Phone
de: Telefon

source: Available 24/7 on our website
de: Rund um die Uhr auf unserer Website verfügbar

source: We are here to help and guide you with the Lord’s wisdom. You are not alone!
de: Wir sind hier, um Ihnen mit der Weisheit des Herrn zu helfen und Sie zu begleiten. Sie sind nicht allein!

source: John 8:12<br /> Then Jesus spoke to them again, saying, “I am the light of the world. He who follows Me shall not walk in darkness, but have the light of life.”
de: Johannes 8:12<br /> Dann redete Jesus wieder zu ihnen und sprach: „Ich bin das Licht der Welt. Wer mir nachfolgt, wird nicht in der Finsternis wandeln, sondern das Licht des Lebens haben.“

source: God loves you, as you are. Right at this moment, with all your failings and faults! He loves you in spite of them.
de: Gott liebt dich so, wie du bist. Genau in diesem Moment – mit all deinen Fehlern und Schwächen! Er liebt dich trotz allem.

source: Welcome to
de: Willkommen bei

source: A Light Unto My Path
de: Ein Licht auf meinem Weg

source: Verse of the Day
de: Vers des Tages

source: No verse available. Please try again later.
de: Kein Vers verfügbar. Bitte versuchen Sie es später erneut.

source: Let's play some games!
de: Lass uns ein paar Spiele spielen!

source: Are you ready to test your Bible knowledge in a fun and engaging way? Dive into our exciting quizzes and challenge yourself with three thought-provoking topics:
de: Bist du bereit, dein Bibelwissen auf unterhaltsame und spannende Weise zu testen? Stürze dich in unsere aufregenden Quizze und fordere dich mit drei zum Nachdenken anregenden Themen heraus:

source: What am I?
de: Was bin ich?

source: Where am I?
de: Wo bin ich?

source: Who am I?
de: Wer bin ich?

source: Each topic offers three levels—
de: Jedes Thema bietet drei Schwierigkeitsstufen –

source: Easy
de: Einfach

source: Medium
de: Mittel

source: Hard
de: Schwierig

source: —so whether you're just starting or you're a seasoned Bible scholar, there's a quiz for you!
de: – ganz gleich, ob du gerade erst anfängst oder ein erfahrener Bibelkenner bist – es gibt ein Quiz für dich!

source: Explore the scriptures, learn new insights, and see how well you really know the Bible. Take a quiz today and put your knowledge to the test!
de: Erkunde die Heilige Schrift, entdecke neue Erkenntnisse und finde heraus, wie gut du die Bibel wirklich kennst. Mach heute ein Quiz und teste dein Wissen!

source: Start?
de: Starten?

source: No
de: Nein

source: Let's go
de: Los geht's

source: Enjoy our quizzes!
de: Viel Spaß mit unseren Quizzen!

source: score to pass
de: Bestehenspunktzahl

source: Submit Quiz
de: Quiz abschicken

source: Back to All Quizzes
de: Zurück zu allen Quizzen

source: Home
de: Startseite

source: About
de: Über uns

source: Contact
de: Kontakt

source: Logout
de: Abmelden

source: Login / Sign Up
de: Anmelden / Registrieren

source: Confirm Logout
de: Abmeldung bestätigen

source: Are you sure you want to log out?
de: Sind Sie sicher, dass Sie sich abmelden möchten?

source: Cancel
de: Abbrechen

source: Made by Illana De Beer
de: Erstellt von Illana De Beer
